// pages/commutingBus/commutingBus.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    listData: [{
        "route":"老-->新",
        "week":"周一至周五",
        "time": "7:30",
        "text": "主教学楼前、（文理新村）、美伦小区（三辆）"
      },
      {
        "route":"老-->新",
        "week":"周一至周五",
        "time": "7:50",
        "text": "主教学楼前、（文理新村）、美伦小区（一辆）"
      },
      {
        "route":"老-->新",
        "week":"周一至周五",
        "time": "9:40",
        "text": "主教学楼前、文理新村、美伦小区（一辆）"
      },
      {
        "route":"老-->新",
        "week":"周一至周五",
        "time": "10:05",
        "text": "主教学楼前（一辆）"
      },
      {
        "route":"老-->新",
        "week":"周一至周五",
        "time": "12:05",
        "text": "主教学楼前（一辆）"
      },
      {
        "route":"老-->新",
        "week":"周一至周五",
        "time": "14:10",
        "text": "主教学楼前、（文理新村）、美伦小区（三辆）"
      },
      {
        "route":"老-->新",
        "week":"周一至周五",
        "time": "16:05",
        "text": "主教学楼前、文理新村、美伦小区（一辆）"
      },
      {
        "route":"老-->新",
        "week":"周一至周五",
        "time": "16:30",
        "text": "主教学楼前（一辆）"
      },
      {
        "route":"老-->新",
        "week":"周一至周五",
        "time": "17:30",
        "text": "送幼儿园学生专车（一辆）"
      },
      {
        "route":"老-->新",
        "week":"周一至周五",
        "time": "18:35",
        "text": "主教学楼前（一辆）"
      },
      {
        "route":"老-->新",
        "week":"周六至周日",
        "time": "7:30",
        "text": "主教学楼前—美伦小区（一辆）"
      },
      {
        "route":"老-->新",
        "week":"周六至周日",
        "time": "14:10",
        "text": "主教学楼前—美伦小区（一辆）"
      },
      {
        "route":"新-->老",
        "week":"周一至周五",
        "time": "7:35",
        "text": "宝大馨园门口（一辆）"
      },
      {
        "route":"新-->老",
        "week":"周一至周五",
        "time": "7:50",
        "text": "宝大馨园门口（接幼儿园、附小学生）（一辆）"
      },
      {
        "route":"新-->老",
        "week":"周一至周五",
        "time": "9:40",
        "text": "宝大馨园门口（一辆）"
      },
      {
        "route":"新-->老",
        "week":"周一至周五",
        "time": "10:05",
        "text": "新校区正门口（一辆）"
      },
      {
        "route":"新-->老",
        "week":"周一至周五",
        "time": "12:10",
        "text": "图书馆北门—新校区正门口（三辆）"
      },
      {
        "route":"新-->老",
        "week":"周一至周五",
        "time": "14:10",
        "text": "宝大馨园门口（一辆）"
      },
      {
        "route":"新-->老",
        "week":"周一至周五",
        "time": "16:05",
        "text": "宝大馨园门口（一辆）"
      },
      {
        "route":"新-->老",
        "week":"周一至周五",
        "time": "16:30",
        "text": "新校区正门口（一辆）"
      },
      {
        "route":"新-->老",
        "week":"周一至周五",
        "time": "18:30",
        "text": "图书馆北门（一辆）、新校区正门口（两辆）"
      },
      {
        "route":"新-->老",
        "week":"周六至周日",
        "time": "12:10",
        "text": "图书馆北门（一辆）"
      },
      {
        "route":"新-->老",
        "week":"周六至周日",
        "time": "18:30",
        "text": "图书馆北门（一辆）"
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})